Найти наименьший положительный корень уравнения x-cos(x)=0 методом Ньютона с абсолютной точностью Eps=10^-5.
Аргументы тригонометрических функций задаются в радианах.

Использовать функцию и её производную:
f(x)=x-cos(x),
"f'(x)=1+\sin x.'"

Принять начальное приближение x_0 = 1 и вычислять последующие приближения по формуле: x_{n+1}=x_n- x_n- cos {x_n}{1+\sin x_n}.
В качестве условия остановки использовать: |x_{n+1}-x_n|<Eps.

Также завершать вычисления при точном равенстве значения функции нулю. При нулевой производной выдавать сообщение о невозможности выполнить следующий шаг.

Вывести:
приближённое значение корня;
значение функции в найденной точке;
количество выполненных итераций.

import math

def f(x):
    return x - math.cos(x)

def df(x):
    return 1 + math.sin(x)

# Метод Ньютона.
# x — начальное приближение.
# e — допустимая разница соседних приближений.
def newt(x, e):
    k = 0
    while True:
        xp = x
        y = f(xp)
        k += 1
        if y == 0:
            return xp, k
        proizv = df(xp)
        if proizv == 0:
            raise ValueError("Производная равна нулю")

        # Вычисляем новое приближение по формуле Ньютона.
        x = xp - y / proizv

        # Завершаем вычисления, если соседние приближения близки.
        if abs(x - xp) < e:
            return x, k


# Начальное приближение.
x0 = 1

# Порог разницы соседних приближений.
e = 1e-5
x, k = newt(x0, e)

print(f"Приближённый корень: {x:.10f}")
print(f"Значение функции: {f(x):.10f}")
print(f"Число итераций: {k}")
