import math

# Исходная функция.
def f(x):
    return x - math.cos(x)

# Производная исходной функции.
def df(x):
    return 1 + math.sin(x)

# Метод Ньютона.
# x — начальное приближение.
# e — допустимая разница соседних приближений.
def newt(x, e):
    k = 0
    while True:
        xp = x
        y = f(xp)
        k += 1
        if y == 0:
            return xp, k
        proizv = df(xp)
        if proizv == 0:
            raise ValueError("Производная равна нулю")

        # Вычисляем новое приближение по формуле Ньютона.
        x = xp - y / proizv

        # Завершаем вычисления, если соседние приближения близки.
        if abs(x - xp) < e:
            return x, k


# Начальное приближение.
x0 = 1

# Порог разницы соседних приближений.
e = 1e-5
x, k = newt(x0, e)

print(f"Приближённый корень: {x:.10f}")
print(f"Значение функции: {f(x):.10f}")
print(f"Число итераций: {k}")
